_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_MSP_СтатусыВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_MSP_СтатусыВыгрузкиДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_MSP_СтатусыВыгрузкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_MSP_СтатусыВыгрузкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_MSP_СтатусыВыгрузкиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененПослеВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_MSP_ВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает Структуру параметров настроек обмена с MS PROJECT.
// Данные беруться из регистра сведений СМ_MSP_НастройкиИнтеграции.
//
// Возвращаемое значение:
//     Структура - содержит поля, аналогичные ресурсам регистра сведений СМ_MSP_НастройкиИнтеграции.
//
Функция ПрочитатьНастройкиОбменаMSP() Экспорт
	
	Параметры = Новый Структура();
	
	НаборДанных = РегистрыСведений.СМ_MSP_НастройкиИнтеграции.СоздатьНаборЗаписей();
	НаборДанных.Прочитать();
	
	Если НаборДанных.Количество() > 0 Тогда
		
		Данные = НаборДанных[0];
	
		Для Каждого Ресурс из Метаданные.РегистрыСведений.СМ_MSP_НастройкиИнтеграции.Ресурсы Цикл
			
			Параметры.Вставить(Ресурс.Имя, Данные[Ресурс.Имя]);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Записывает настройки в регистр сведений СМ_MSP_НастройкиИнтеграции.
//
// Параметры:
//     Структура - Структура - содержит данные для записи в настройки.
//
// Возвращаемое значение:
//     Булево - Истина - запись успешна, Ложь - запись не успешна.
//
Функция ЗаписатьНастройкиОбменаMSP(Структура) Экспорт
	
	НаборДанных = РегистрыСведений.СМ_MSP_НастройкиИнтеграции.СоздатьНаборЗаписей();
	Данные = НаборДанных.Добавить();
	ЗаполнитьЗначенияСвойств(Данные, Структура); 
	Попытка 
		НаборДанных.Записать(Истина);
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

// Заполняет сводную таблицу с колонками:
// 	* MSP_НаименованиеОбъекта
//  * MSP_НаименованиеЗадачи
//  * MSP_НаименованиеРесурса
//  * MSP_ЕдиницаИзмеренияРесурса
// И возможно, колонки дополнительных свойств из файла MS PROJECT, 
// ссылка на который указана в реквизитах объекта строительства.
//
// Параметры:
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на объект.
//     Таблица - ТаблицаЗначений - таблица с описанными выше значениями.
//	   ИспользоватьДопРеквизиты - Булево - флаг использования допольнительных реквизитов.
//	   НаименованиеПроекта - Строка - название проекта. 
//
// Возвращаемое значение:
//     Истина - запись успешна, иначе - не успешна.
//
Функция ПрочитатьФайлОбъекта(ОбъектСтроительства, Таблица,ИспользоватьДопРеквизиты=Ложь,НаименованиеПроекта="") Экспорт
	
	Таблица.Строки.Очистить();
   
	АдресФайла = ОбъектСтроительства.ПутьПроектMSP;
	
	Если Не ЗначениеЗаполнено(АдресФайла) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен путь к файлу MS PROJECT в объекте строительства'"));
		
		Возврат Ложь;
		
	КонецЕсли; 
	
	MSProject = Неопределено;
	
	Попытка
		
		MSProject = Новый COMОбъект("MSProject.Application"); 
		MSProject.DisplayAlerts = False;
		MSProject.Visible=False;
		Попытка
		ВерсияMSP = Лев(MSProject.Version,2);
		
			ВерсияMSProject = Число(ВерсияMSP);
		Исключение
			ВерсияMSProject = 0;
		КонецПопытки;
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка инициализации MS Project: '")+ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Попытка
		
		MSProject.FileOpenEx(АдресФайла, Истина);
	    Проект = MSProject.ActiveProject;
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка открытия файла MS Project: '")+ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Номер=1;
	СтрокаПроекта = Таблица.Строки.Добавить();
 	СтрокаПроекта.MSP_НаименованиеОбъекта = Проект.Name;
	НаименованиеПроекта=СтрокаПроекта.MSP_НаименованиеОбъекта;
	СтрокаПроекта.MSP_ВидОбъекта ="Проект";
	СтрокаПроекта.НомерДляСопоставления=Номер;
	СтрокаПроекта.ЕстьВложенныеЗадачи=Истина;
	Номер=Номер+1;
	Для Каждого Задача Из Проект.Tasks Цикл
		Если Задача.Outlinelevel=1 Тогда
		СтрокаТЗ = СтрокаПроекта.Строки.Добавить();	
		СтрокаТЗ.MSP_НаименованиеОбъекта = Задача.Name;
		СтрокаТЗ.MSP_GUID = Задача.GUID;
		СтрокаТЗ.MSP_ВидОбъекта = "Задача";
		СтрокаТЗ.НомерДляСопоставления=Номер;
		Номер=Номер+1;
		Если  ИспользоватьДопРеквизиты Тогда
			УстановитьЗначениеДопРеквизитовВСтроке(Задача,СтрокаТЗ,Таблица.Колонки, MSProject);
		КонецЕсли;

		ДобавитьСтрокиПодзадач(СтрокаТЗ,MSProject,Проект,Задача,ИспользоватьДопРеквизиты,Таблица.Колонки,Номер);
		
		ДобавитьРесурсыЗадачи(Задача,СтрокаТЗ,MSProject,Таблица.Колонки,ИспользоватьДопРеквизиты,Номер);
	    КонецЕсли;
	КонецЦикла; 
	  MSProject.Quit();
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьСтрокиПодзадач(УзелРодитель,Приложение,Проект,Задача,ИспользоватьДопРеквизиты,КолонкиТаблицы,Номер)
	
	Для каждого Подзадача Из Задача.OutlineChildren Цикл
		СтрокаТЗ = УзелРодитель.Строки.Добавить();	
		СтрокаТЗ.MSP_НаименованиеОбъекта = Подзадача.Name;
		СтрокаТЗ.MSP_ВидОбъекта = "Задача";
		СтрокаТЗ.MSP_GUID = Подзадача.GUID;
		СтрокаТЗ.НомерДляСопоставления=Номер;
		УзелРодитель.ЕстьВложенныеЗадачи=Истина;
		Номер=Номер+1;

		Если   ИспользоватьДопРеквизиты Тогда
			УстановитьЗначениеДопРеквизитовВСтроке(Подзадача,СтрокаТЗ,КолонкиТаблицы, Приложение);
		КонецЕсли;
		ДобавитьСтрокиПодзадач(СтрокаТЗ,Приложение,Проект,Подзадача,ИспользоватьДопРеквизиты,КолонкиТаблицы,Номер);
		ДобавитьРесурсыЗадачи(Подзадача,СтрокаТЗ,Приложение,КолонкиТаблицы,ИспользоватьДопРеквизиты,Номер);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьРесурсыЗадачи(Задача,УзелРодитель,Приложение,КолонкиТаблицы,ИспользоватьДопРеквизиты,Номер)
	Для каждого Asgn Из Задача.Assignments Цикл
		СтрокаТЗ = УзелРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,УзелРодитель);
		СтрокаТЗ.MSP_НаименованиеОбъекта = Asgn.ResourceName;
		СтрокаТЗ.MSP_ЕдиницаИзмеренияРесурса = Asgn.Resource.MaterialLabel;
		СтрокаТЗ.MSP_Объем=Asgn.Work;
		СтрокаТЗ.MSP_ВидОбъекта = "Ресурс";
		СтрокаТЗ.MSP_GUID = Asgn.GUID;
		СтрокаТЗ.НомерДляСопоставления=Номер;
		Номер=Номер+1;

	КонецЦикла;
КонецПроцедуры

Процедура УстановитьЗначениеДопРеквизитовВСтроке(Задача,СтрокаТЗ,КолонкиТаблицы, Приложение)
	Для Каждого Рекв Из КолонкиТаблицы Цикл
		Если СтрДлина(Рекв.Заголовок)>0 Тогда
			Попытка
				СтрокаТЗ[Рекв.Имя]=Задача.GetField(Приложение.FieldNameToFieldConstant(Рекв.Заголовок));
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Формирует и записывает файл объекта строительства
//
// Параметры:
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на объект.
//     Таблица - ТаблицаЗначений - содержит данные объекта строительства.
//
// Возвращаемое значение:
//     Истина - запись файла успешна, иначе - не успешна.
//
Функция ЗаписатьФайлОбъекта(ОбъектСтроительства,Таблица) Экспорт
	
	АдресФайла 		= ОбъектСтроительства.ПутьПроектMSP;
	ИмяФайла 		= СтрЗаменить(АдресФайла,"\",Символы.ПС);
	ИмяФайла 		= СтрПолучитьСтроку(ИмяФайла,СтрЧислоСтрок(ИмяФайла));
	АдресПротокола 	= СтрЗаменить(АдресФайла,ИмяФайла,"")+"MSPПротоколВыгрузки.txt";
	Док				= Новый ТекстовыйДокумент;

	Попытка
		
		Если Не ЗначениеЗаполнено(АдресФайла) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен путь к файлу MS PROJECT в объекте строительства'"));
			Возврат Ложь;
		КонецЕсли; 
	
		MSProject = Неопределено;
	
		//Попытка
		
		MSProject = Новый COMОбъект("MSProject.Application"); 
		MSProject.DisplayAlerts = False;
		MSProject.Visible=False;
		Попытка
			ВерсияMSP = Лев(MSProject.Version,2);
			ВерсияMSProject = Число(ВерсияMSP);
		Исключение
			ВерсияMSProject = 0;
		КонецПопытки;
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка инициализации MS Project: '")+ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Попытка
		
		MSProject.FileOpenEx(АдресФайла, Ложь);
	    Проект = MSProject.ActiveProject;
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка открытия файла MS Project: '")+ОписаниеОшибки());
		
		Возврат Ложь;
		
	КонецПопытки;

	Для Каждого Задача Из Проект.Tasks Цикл
		Для каждого Asgn Из Задача.Assignments Цикл
			СтрокиТЗ=Таблица.НайтиСтроки(Новый Структура("GUID",Asgn.GUID));
			Если СтрокиТЗ.Количество()>0 Тогда
				Док.ДобавитьСтроку(Задача.Name+" "+Asgn.ResourceName+" Старый объем:"+Asgn.Work+" Новый объем:"+СтрокиТЗ[0].Объем);	
				Asgn.Work= СтрЗаменить(СтрокиТЗ[0].Объем,Символы.НПП,"");
				//Asgn.Resource.MaterialLabel=СтрокиТЗ[0].Единица;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
     MSProject.Application.FileSave();
	 MSProject.Application.Quit();
	// Исключение
	//КонецПопытки;
	 Док.Записать(АдресПротокола);
	 
	Возврат Истина;
	
КонецФункции

// Возвращает путь к файлу проекта MS PROJECT.
//
// Параметры:
//     ОбъектСтроительства - СправочникСсылка.СМ_ОбъектыСтроительства - ссылка на объект.
//
// Возвращаемое значение:
//     Строка - путь к файлу проекта MS PROJECT.
//
Функция ПолучитьПутьПроектMSP(ОбъектСтроительства) Экспорт
	
	Возврат ОбъектСтроительства.ПутьПроектMSP;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтатусВыгрузкиСметы(Смета) Экспорт
	Если Смета.Пустая() ИЛИ Не Константы.СМ_MSP_ИспользоватьИнтеграциюMSP.Получить() Тогда
		Возврат "";
	Конецесли;
	
	Запрос=Новый Запрос( "ВЫБРАТЬ
	                     |	СМ_ПозицияЛокальнойСметы.Ссылка
	                     |ПОМЕСТИТЬ Позиции
	                     |ИЗ
	                     |	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	                     |ГДЕ
	                     |	СМ_ПозицияЛокальнойСметы.ИДСметы = &ИДСметы
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	СМ_MSP_СтатусыВыгрузкиДокументов.Документ,
	                     |	СМ_MSP_СтатусыВыгрузкиДокументов.Статус,
	                     |	Позиции.Ссылка
	                     |ИЗ
	                     |	РегистрСведений.СМ_MSP_СтатусыВыгрузкиДокументов КАК СМ_MSP_СтатусыВыгрузкиДокументов
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Позиции КАК Позиции
	                     |		ПО СМ_MSP_СтатусыВыгрузкиДокументов.Документ = Позиции.Ссылка
	                     |ГДЕ
	                     |	СМ_MSP_СтатусыВыгрузкиДокументов.Статус = ЗНАЧЕНИЕ(Перечисление.СМ_MSP_СтатусыВыгрузкиДокументов.Выгружен)
	                     |;
	                     |ВЫБРАТЬ
	                     |	СМ_MSP_СтатусыВыгрузкиДокументов.Документ,
	                     |	СМ_MSP_СтатусыВыгрузкиДокументов.Статус,
	                     |	Позиции.Ссылка
	                     |ИЗ
	                     |	РегистрСведений.СМ_MSP_СтатусыВыгрузкиДокументов КАК СМ_MSP_СтатусыВыгрузкиДокументов
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Позиции КАК Позиции
	                     |		ПО СМ_MSP_СтатусыВыгрузкиДокументов.Документ = Позиции.Ссылка
	                     |ГДЕ
	                     |	СМ_MSP_СтатусыВыгрузкиДокументов.Статус = ЗНАЧЕНИЕ(Перечисление.СМ_MSP_СтатусыВыгрузкиДокументов.ИзмененПослеВыгрузки)
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	Позиции.Ссылка
	                     |ИЗ
	                     |	Позиции КАК Позиции");
	Запрос.УстановитьПараметр("ИДСметы",Смета);
	Пакет=Запрос.ВыполнитьПакет();
	Статусы=Пакет[1].Выгрузить().Количество();
	СтатусыИзменен=Пакет[2].Выгрузить().Количество();
	Позиции=Пакет[3].Выгрузить().Количество();
	Если Статусы=Позиции и Статусы>0 Тогда 
		Возврат "Выгружена в MS PROJECT";
	ИначеЕсли Статусы=0 Тогда
		Возврат "Не выгружена в MS PROJECT";
	ИначеЕсли  СтатусыИзменен>0 Тогда
		Возврат "Изменена после выгрузки в MS PROJECT";
	Иначе
		Возврат "Выгружена частично в MS PROJECT";
	КонецЕсли;	

КонецФункции

#КонецОбласти
